backend/modules/controllers/ManageController.php

SELECT * FROM `shop_admin`
SELECT COUNT(*) FROM `shop_admin`
SELECT * FROM `shop_admin` LIMIT 1 OFFSET 1
---
    public function actionManagers()
    {
        $this->layout = "layouts1";

        $model = Admin::find();
        $count = $model->count();
        $pageSize = Yii::$app->params['pageSize']['manage'];
        $pager = new Pagination(['totalCount'=>$count,'pageSize'=>$pageSize]);
        $managers = $model->offset($pager->offset)->limit($pager->limit)->all();

SELECT * FROM `shop_admin` WHERE adminuser = 'admin'
---
    public function actionChangeemail()
    {
        $this->layout = 'layouts1';
        $model = Admin::find()->where('adminuser = :user',[':user' => Yii::$app->session['admin']['adminuser']])->one();

SELECT * FROM `shop_admin` WHERE adminuser = 'admin'
---
    public function actionChangepass()
    {
        $this->layout = "layouts1";
        $model = Admin::find()->where('adminuser = :user',[':user' => Yii::$app->session['admin']['adminuser']])->one();