backend/modules/models/Admin.php

    public function validatePass()
    {
        //如果之前不存在错误
        if (!$this->hasErrors()) {
            $data = self::find()->where('adminuser = :user and adminpass = :pass',[':user' => $this->adminuser,":pass" => md5($this->adminpass)])->one();
---
SELECT * FROM `shop_admin` WHERE adminuser = 'admin' and adminpass = 'e10adc3949ba59abbe56e057f20f883e'

    public function validateEmail()
    {
        if (!$this->hasErrors()) {
            $data = self::find()->where('adminuser = :user and adminemail = :email',[':user'=>$this->adminuser,':email'=>$this->adminemail])->one();
---
SELECT * FROM `shop_admin` WHERE adminuser = 'admin' and adminpass = 'e10adc3949ba59abbe56e057f20f883e'

    public function login($data)
    {
        $this->scenario = "login";
        if ($this->load($data) && $this->validate()) {
            //验证成功,将用户信息写入session
            $lifetime = $this->rememberMe ? 24*3600 : 0;
            $session = Yii::$app->session;
            //设置保存session的cookie的有效期
            Yii::$app->session->setCookieParams(['lifetime'=>$lifetime]);
            $session['admin'] = [
                'adminuser' => $this->adminuser,
                'isLogin' => 1,
            ];
            //更新登录时间和登录IP
            $this->updateAll(['logintime'=>time(),'loginip'=>ip2long(Yii::$app->request->userIP)],'adminuser = :user',[':user'=>$this->adminuser]);
---
UPDATE `shop_admin` SET `logintime`='1547637713', `loginip`='2130706433' WHERE adminuser = 'admin'

    public function changePass($data)
    {
        $this->scenario = "changepass";
        if ($this->load($data) && $this->validate()) {
            return (bool)$this->updateAll(['adminpass' => md5($this->adminpass)],'adminuser = :user',[':user' => $this->adminuser]);
---
UPDATE `shop_admin` SET `adminpass`='4297f44b13955235245b2497399d7a93' WHERE adminuser = NULL